"NSURLErrorUnknown"                          = "未知错误";
"NSURLErrorCancelled"                        = "-999";
"NSURLErrorBadURL"                           = "-1000";
"NSURLErrorTimedOut"                         = "请求超时"; // -1001
"NSURLErrorUnsupportedURL"                   = "-1002";
"NSURLErrorCannotFindHost"                   = "-1003";
"NSURLErrorCannotConnectToHost"              = "-1004";
"NSURLErrorDataLengthExceedsMaximum"         = "-1103";
"NSURLErrorNetworkConnectionLost"            = "网络连接已中断";
"NSURLErrorDNSLookupFailed"                  = "-1006";
"NSURLErrorHTTPTooManyRedirects"             = "-1007";
"NSURLErrorResourceUnavailable"              = "-1008";
"NSURLErrorNotConnectedToInternet"           = "您的 iPhone 尚未接入互联网"; // -1009
"NSURLErrorRedirectToNonExistentLocation"    = "-1010";
"NSURLErrorBadServerResponse"                = "-1011";
"NSURLErrorUserCancelledAuthentication"      = "-1012";
"NSURLErrorUserAuthenticationRequired"       = "-1013";
"NSURLErrorZeroByteResource"                 = "-1014";
"NSURLErrorCannotDecodeRawData"              = "-1015";
"NSURLErrorCannotDecodeContentData"          = "-1016";
"NSURLErrorCannotParseResponse"              = "-1017";
"NSURLErrorFileDoesNotExist"                 = "-1100";
"NSURLErrorFileIsDirectory"                  = "-1101";
"NSURLErrorNoPermissionsToReadFile"          = "-1102";
"NSURLErrorSecureConnectionFailed"           = "-1200";
"NSURLErrorServerCertificateHasBadDate"      = "-1201";
"NSURLErrorServerCertificateUntrusted"       = "-1202";
"NSURLErrorServerCertificateHasUnknownRoot"  = "-1203";
"NSURLErrorServerCertificateNotYetValid"     = "-1204";
"NSURLErrorClientCertificateRejected"        = "-1205";
"NSURLErrorClientCertificateRequired"        = "-1206";
"NSURLErrorCannotLoadFromNetwork"            = "-2000";
"NSURLErrorCannotCreateFile"                 = "-3000";
"NSURLErrorCannotOpenFile"                   = "-3001";
"NSURLErrorCannotCloseFile"                  = "-3002";
"NSURLErrorCannotWriteToFile"                = "-3003";
"NSURLErrorCannotRemoveFile"                 = "-3004";
"NSURLErrorCannotMoveFile"                   = "-3005";
"NSURLErrorDownloadDecodingFailedMidStream"  = "-3006";
"NSURLErrorDownloadDecodingFailedToComplete" = "-3007";
